Documents/бит_бу_УстановкаБиллинговыхУслугНаЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_бу_УстановкаБиллинговыхУслугНаЛС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_бу_СведенияОБиллинговыхУслугах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиницПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_бу_СведенияОБиллинговыхУслугах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_бу_СведенияОБиллинговыхУслугах</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугиНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслугНаЛицевомСчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслугиНаЛицевыхСчетах</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_бу_БиллинговыеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_бу_БиллинговыеУслуги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевыеСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначениеЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеЦС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвиженияЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыНачислений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_бу_ТипыНачисленийПоЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РежимыПотребленияУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РежимПотребленияУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_бу_УстановкаБиллинговыхУслугНаЛС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.РежимПотребления.Доступность            = ПрименитьКоВсемЛС;
	Элементы.Поставщик.Доступность                   = ПрименитьКоВсемЛС;
	Элементы.КоличествоЕдиницПотребления.Доступность = ПрименитьКоВсемЛС;
	
	Если  Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет 
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугНаЛицевомСчете Тогда
		
		Элементы.ЛицевойСчет.Видимость  = Истина;
	Иначе
		Элементы.ЛицевойСчет.Видимость  = Ложь;
	КонецЕсли; 
	
	Если  Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугиНаЛицевыхСчетах Тогда
		
		Элементы.БиллинговаяУслуга.Видимость  = Истина;
	Иначе
		Элементы.БиллинговаяУслуга.Видимость  = Ложь;
	КонецЕсли; 
	
	Если  Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугиНаЛицевыхСчетах Тогда
		
		Элементы.ЛицевыеСчетаЛицевойСчет.Видимость = Истина;
	Иначе
		Элементы.ЛицевыеСчетаЛицевойСчет.Видимость = Ложь;
	КонецЕсли; 
	
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугНаЛицевомСчете Тогда
		
		Элементы.ЛицевыеСчетаБиллинговаяУслуга.Видимость = Истина;
	Иначе
		Элементы.ЛицевыеСчетаБиллинговаяУслуга.Видимость = Ложь;
	КонецЕсли; 
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугНаЛицевомСчете
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет Тогда
		
		Элементы.ЛицевыеСчетаЗаполнитьАктуальнымиУслугами.Видимость = Истина;
		
		// БИТ_ЖКХ 12.09.2014
		Элементы.Заполнить.Видимость = Ложь;
		
	Иначе
		Элементы.ЛицевыеСчетаЗаполнитьАктуальнымиУслугами.Видимость = Ложь;
		
		Элементы.Заполнить.Видимость = Истина;
		// БИТ_ЖКХ 12.09.2014
		
	КонецЕсли; 
	
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет 
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета Тогда
		
		Элементы.Настройки.Видимость = Истина;
	Иначе
		Элементы.Настройки.Видимость = Ложь;
	КонецЕсли; 
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет 
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета Тогда
		
		Элементы.ЗаполнитьПоНастройкам.Видимость = Истина;
	Иначе
		Элементы.ЗаполнитьПоНастройкам.Видимость = Ложь;
		
	КонецЕсли; 
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугиНаЛицевыхСчетах Тогда
		
		Элементы.ЛицевыеСчетаЗаполнитьЛицевыеСчета.Видимость = Истина;
	Иначе
		Элементы.ЛицевыеСчетаЗаполнитьЛицевыеСчета.Видимость = Ложь;
	КонецЕсли; 
	
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры // ПослеЗаписи()

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	КэшПеречисления.Вставить("бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг",бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг));
	
	КэшированныеЗначения.Вставить("Перечисления", КэшПеречисления);
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
	КэшированныеЗначения.Вставить("ЗданиеПустаяСсылка"                , Справочники.бит_СписокУлиц.ПустаяСсылка());
	КэшированныеЗначения.Вставить("ЛицевойСчетПустаяСсылка"           , Справочники.бит_ЛицевыеСчета.ПустаяСсылка());
	КэшированныеЗначения.Вставить("ПоставщикПустаяСсылка"             , Справочники.бит_ПоставщикиУслуг.ПустаяСсылка());
	КэшированныеЗначения.Вставить("РежимыПотребленияУслугПустаяСсылка", Справочники.бит_РежимыПотребленияУслуг.ПустаяСсылка());
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаКлиенте
Процедура ПрименитьКоВсемЛСПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	// БИТ_ЖКХ_27012014_начало_изменений
	// Если НЕ Объект.Здание.Улица = Объект.Улица Тогда
	Если НЕ ПолучитьУлицуЗданияНаСервере(Объект.Здание) = Объект.Улица Тогда	
		// БИТ_ЖКХ_27012014_окончание_изменений
		
		Объект.Здание      = мКэшЗначений.ЗданиеПустаяСсылка;
		Объект.ЛицевойСчет = мКэшЗначений.ЛицевойСчетПустаяСсылка;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	Объект.ЛицевыеСчета.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("Улица", Объект.Улица);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И ПрименитьКоВсемЛС Тогда
		
		ТекСтрока = Элементы.ЛицевыеСчета.ТекущиеДанные;
		
		ТекСтрока.РежимПотребления = РежимПотребления;
		ТекСтрока.Поставщик        = Поставщик;
		
		ТекСтрока.КоличествоЕдиницПотребления = КоличествоЕдиницПотребления;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Улица) И ЗначениеЗаполнено(Объект.Здание) Тогда
		
		ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка);
	Иначе
		Текст = "Перед выбором лицевого счета, укажите: " + 
		?(ЗначениеЗаполнено(Объект.Улица),"","""Улица"""+?(ЗначениеЗаполнено(Объект.Здание),"",", ")) + 
		?(ЗначениеЗаполнено(Объект.Здание),"","""Здание""");
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить(Текст, СтатусСообщения.ОченьВажное);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка, СписокЛС = Неопределено);
	
	СтандартнаяОбработка = Ложь;
	
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("УлицаЛицевогоСчета", Объект.Улица);
	УсловияОтбора.Вставить("Здание"            , Объект.Здание);
	
	Если НЕ СписокЛС = Неопределено Тогда
		
		Если СписокЛС.Количество() Тогда
			
			УсловияОтбора.Вставить("ССылка", СписокЛС);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", УсловияОтбора);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Объект.Улица) И ЗначениеЗаполнено(Объект.Здание) Тогда
		СписокЛС = ПолучитьСписок("ЛицевойСчет");
		ОткрытьФормуВыбораЛицевогоСчета(Элемент, СтандартнаяОбработка , СписокЛС);
	Иначе
		Текст = "Перед выбором лицевого счета, укажите: " + 
		?(ЗначениеЗаполнено(Объект.Улица),"","""Улица"""+?(ЗначениеЗаполнено(Объект.Здание),"",", ")) + 
		?(ЗначениеЗаполнено(Объект.Здание),"","""Здание""");

		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить(Текст, СтатусСообщения.ОченьВажное);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАктуальнымиУслугами(Команда)
	
	ПолучитьСписокУслуг();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Объект.ЛицевыеСчета.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокУслуг()
	
	Объект.ЛицевыеСчета.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент"     , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.ЛицевойСчет,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.РежимПотребления,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Поставщик,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.КоличествоЕдиницПотребления
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(
	|			&Момент,
	|			Организация = &Организация
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних
	|ГДЕ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Использовать";
	
	Результат = Запрос.Выполнить();
	
	Объект.ЛицевыеСчета.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНастройкам(Команда)
	
	Если ПрименитьКоВсемЛС Тогда
		ЗаполнитьТаблицуПоНастройкам();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоНастройкам()
	
	Для каждого СтрокаТаблицы Из Объект.ЛицевыеСчета Цикл
		
		ЗаполнитьСтрокуПоНастройкам(СтрокаТаблицы);
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуПоНастройкам(СтрокаТаблицы)
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета Тогда
		
		ТаблицаПоставщиков        = Объект.Услуга.Поставщики;
		ТаблицаРежимовПотребления = Объект.Услуга.РежимыПотребленияУслуг;
		
	ИначеЕсли Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет Тогда
		
		ТаблицаПоставщиков        = СтрокаТаблицы.Услуга.Поставщики;
		ТаблицаРежимовПотребления = СтрокаТаблицы.Услуга.РежимыПотребленияУслуг;
		
	КонецЕсли;
	
	ПоставщикУслуги = ТаблицаПоставщиков.Найти(Поставщик, "Поставщик");
	
	Если НЕ ПоставщикУслуги = Неопределено Тогда
		
		СтрокаТаблицы.Поставщик = Поставщик;
		
	КонецЕсли;
	
	РежимПотребленияУслуги = ТаблицаРежимовПотребления.Найти(РежимПотребления, "РежимПотребленияУслуг");
	
	Если НЕ РежимПотребленияУслуги = Неопределено Тогда
		
		СтрокаТаблицы.РежимПотребления = РежимПотребления;
		
	КонецЕсли;
	
	СтрокаТаблицы.КоличествоЕдиницПотребления = КоличествоЕдиницПотребления;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЛицевыеСчета(Команда)
	
	ЗаполнитьЛС();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛС()
	
	Объект.ЛицевыеСчета.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Здание"     , Объект.Здание);
	Запрос.УстановитьПараметр("Улица"      , Объект.Улица);
	Запрос.УстановитьПараметр("Услуга"     , Объект.Услуга);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Момнет"     , КонецДня(Объект.Дата));
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета Тогда
		
		ПостроительЗапроса = Новый ПостроительЗапроса;
		ПостроительЗапроса.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
		|	бит_ЛицевыеСчета.Наименование КАК Наименование,
		|	бит_ЛицевыеСчета.Здание,
		|	бит_ЛицевыеСчета.УлицаЛицевогоСчета
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ЛицевыеСчета.Ссылка,
		|	бит_ЛицевыеСчета.Наименование,
		|	бит_ЛицевыеСчета.Здание
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		ПостроительЗапроса.ЗаполнитьНастройки();
		
		Если ЗначениеЗаполнено(Объект.Здание) Тогда
			
			ПостроительЗапроса.Отбор.Добавить("Здание");
			ПостроительЗапроса.Отбор.Здание.Установить(Объект.Здание, Истина);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Улица) Тогда
			
			ПостроительЗапроса.Отбор.Добавить("УлицаЛицевогоСчета");
			ПостроительЗапроса.Отбор.УлицаЛицевогоСчета.Установить(Объект.Улица, Истина);
			
		КонецЕсли; 
		
		ПостроительЗапроса.Выполнить();
		Выборка = ПостроительЗапроса.Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
			НоваяСтрока.ЛицевойСчет 				= Выборка.ЛицевойСчет;
			
			Если ПрименитьКоВсемЛС Тогда
				
				ЗаполнитьСтрокуПоНастройкам(НоваяСтрока);
				
			КонецЕсли; 
			
		КонецЦикла;
		
	ИначеЕсли Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугиНаЛицевыхСчетах Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.ЛицевойСчет,
		|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.РежимПотребления,
		|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Поставщик,
		|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.КоличествоЕдиницПотребления
		|ИЗ
		|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(
		|			&Момнет,
		|			Организация = &Организация
		|				И Услуга = &Услуга) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних
		|ГДЕ
		|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Использовать";
		
		Результат = Запрос.Выполнить();
		Таблица   = Результат.Выгрузить();
		
		Объект.ЛицевыеСчета.Загрузить(Таблица);
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура БиллинговаяУслугаПриИзменении(Элемент)
	
	Объект.ЛицевыеСчета.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаБиллинговаяУслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		
		Если НЕ СтрокаТаблицы.Услуга = ВыбранноеЗначение Тогда
			
			Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугНаЛицевомСчете Тогда
				
				СтандартнаяОбработка = Ложь;
				
				// БИТ_ЖКХ 12.08.2014
				// Строка = ЗаполнитьПриСнятии(ВыбранноеЗначение, Объект.ЛицевойСчет);.
				Структура = ЗаполнитьПриСнятии(ВыбранноеЗначение, Объект.ЛицевойСчет);
				
				Если Структура <> Неопределено Тогда
					
					Если Структура.Количество > 0 Тогда
						
						СтрокаТаблицы.Поставщик                   = Структура.Поставщик;
						СтрокаТаблицы.РежимПотребления            = Структура.РежимПотребления;
						СтрокаТаблицы.КоличествоЕдиницПотребления = Структура.КоличествоЕдиницПотребления;
						
					КонецЕсли; 
					
				КонецЕсли; 
				// БИТ_ЖКХ 12.08.2014
				
				СтрокаТаблицы.Услуга = ВыбранноеЗначение;
				
			Иначе
				
				СтрокаТаблицы.Поставщик                   = мКэшЗначений.ПоставщикПустаяСсылка;
				СтрокаТаблицы.РежимПотребления            = мКэшЗначений.РежимыПотребленияУслугПустаяСсылка;
				СтрокаТаблицы.КоличествоЕдиницПотребления = 0;
				
			КонецЕсли; 
			
			
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПриСнятии(Услуга, ЛицевойСчет)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Момнет"     , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Услуга"     , Услуга);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Услуга,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.РежимПотребления,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Поставщик,
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.КоличествоЕдиницПотребления
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(
	|			&Момнет,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Организация = &Организация
	|				И Услуга = &Услуга) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних";
	
	Результат = Запрос.Выполнить();
	Таблица   = Результат.Выгрузить();
	
	// БИТ_ЖКХ 12.08.2014
	// Возврат Таблица;
	Если Таблица.Количество() Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Количество",Таблица.Количество());
		Структура.Вставить("Поставщик",Таблица[0].Поставщик);
		Структура.Вставить("РежимПотребления",Таблица[0].РежимПотребления);
		Структура.Вставить("КоличествоЕдиницПотребления",Таблица[0].КоличествоЕдиницПотребления);
		
	КонецЕсли; 
	
	Возврат Структура;
	// БИТ_ЖКХ 12.08.2014
	
КонецФункции

&НаКлиенте
Процедура ЛицевыеСчетаЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		
		Если НЕ СтрокаТаблицы.ЛицевойСчет = ВыбранноеЗначение Тогда
			
			Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугиНаЛицевыхСчетах Тогда
				
				
				СтандартнаяОбработка = Ложь;
				Строка = ЗаполнитьПриСнятии(Объект.Услуга, ВыбранноеЗначение);
				
				Если Строка.Количество() Тогда
					
					СтрокаТаблицы.Поставщик                   = Строка[0].Поставщик;
					СтрокаТаблицы.РежимПотребления            = Строка[0].РежимПотребления;
					СтрокаТаблицы.КоличествоЕдиницПотребления = Строка[0].КоличествоЕдиницПотребления;
					
				КонецЕсли; 
				
				СтрокаТаблицы.ЛицевойСчет = ВыбранноеЗначение;
				
			Иначе
				
				СтрокаТаблицы.Поставщик                   = мКэшЗначений.ПоставщикПустаяСсылка;
				СтрокаТаблицы.РежимПотребления            = мКэшЗначений.РежимыПотребленияУслугПустаяСсылка;
				СтрокаТаблицы.КоличествоЕдиницПотребления = 0;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// СписокПоставщиков = Новый СписокЗначений; // БИТ_ЖКХ_27012014_изменение.
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугиНаЛицевыхСчетах Тогда
		
		// БИТ_ЖКХ_27012014_начало_изменений
		// ТаблицаПоставщиков        = Объект.Услуга.Поставщики;.
		СписокПоставщиков = ПолучитьСписокПоставщиковНаСервере(Объект.Услуга);
		// БИТ_ЖКХ_27012014_окончание_изменений
		
	ИначеЕсли Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет 
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугНаЛицевомСчете Тогда
		
		// БИТ_ЖКХ_27012014_начало_изменений
		// ТаблицаПоставщиков        = СтрокаТаблицы.Услуга.Поставщики;.
		СписокПоставщиков = ПолучитьСписокПоставщиковНаСервере(СтрокаТаблицы.Услуга);
		// БИТ_ЖКХ_27012014_окончание_изменений
		
	КонецЕсли;
	
	// СписокПоставщиков.ЗагрузитьЗначения(ТаблицаПоставщиков.ВыгрузитьКолонку("Поставщик")); // БИТ_ЖКХ_27012014_изменение.
	
	СтруктураОбора = Новый Структура("Ссылка",СписокПоставщиков);
	
	ОткрытьФорму("Справочник.бит_ПоставщикиУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", СтруктураОбора),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаРежимПотребленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// СписокРежимовПотребления = Новый СписокЗначений; // БИТ_ЖКХ_27012014_изменение.
	
	СтрокаТаблицы = Элементы.ЛицевыеСчета.ТекущиеДанные;
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугиНаЛицевыеСчета
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугиНаЛицевыхСчетах Тогда
		
		// БИТ_ЖКХ_27012014_начало_изменений
		// ТаблицаРежимовПотребления = Объект.Услуга.РежимыПотребленияУслуг;.
		СписокРежимовПотребления = ПолучитьСписокРежимовПотребленияНаСервере(Объект.Услуга);
		// БИТ_ЖКХ_27012014_окончание_изменений
		
	ИначеЕсли Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.НазначениеУслугНаЛицевойСчет 
		ИЛИ Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугНаЛицевомСчете Тогда
		
		// БИТ_ЖКХ_27012014_начало_изменений
		// ТаблицаРежимовПотребления = СтрокаТаблицы.Услуга.РежимыПотребленияУслуг;.
		СписокРежимовПотребления = ПолучитьСписокРежимовПотребленияНаСервере(СтрокаТаблицы.Услуга);
		// БИТ_ЖКХ_27012014_окончание_изменений
		
	КонецЕсли;
	
	СтруктураОбора = Новый Структура("Ссылка",СписокРежимовПотребления);
	
	ОткрытьФорму("Справочник.бит_РежимыПотребленияУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", СтруктураОбора),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевыеСчетаБиллинговаяУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ВидОперации = мКэшЗначений.Перечисления.бит_бу_ВидыОперацийУстановкаИзменениеБиллинговыхУслуг.ОтключениеУслугНаЛицевомСчете Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокУслуг = ПолучитьСписок("Услуга");
		
		СтруктураОтбора = Новый Структура("Ссылка", СписокУслуг);
		
		ОткрытьФорму("Справочник.бит_бу_БиллинговыеУслуги.ФормаВыбора",Новый Структура("Отбор", СтруктураОтбора),Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписок(Поле)
	
	Список = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момнет"     , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних."+Поле+" КАК "+Поле+"
	|ИЗ
	|	РегистрСведений.бит_бу_СведенияОБиллинговыхУслугах.СрезПоследних(&Момнет, Организация = &Организация) КАК бит_бу_СведенияОБиллинговыхУслугахСрезПоследних
	|ГДЕ
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_бу_СведенияОБиллинговыхУслугахСрезПоследних."+Поле+"";
	
	Результат = Запрос.Выполнить();
	Таблица   = Результат.Выгрузить();
	Список.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку(Поле));
	
	Возврат Список;
	
КонецФункции 

&НаКлиенте
Процедура РежимПотребленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокРежимовПотребления = ПолучитьСписокРежимовПотребленияНаСервере(Объект.Услуга);
	
	СтруктураОбора = Новый Структура("Ссылка",СписокРежимовПотребления);
	
	ОткрытьФорму("Справочник.бит_РежимыПотребленияУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", СтруктураОбора),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПоставщиков = ПолучитьСписокПоставщиковНаСервере(Объект.Услуга);	
	
	СтруктураОбора = Новый Структура("Ссылка",СписокПоставщиков);
	
	ОткрытьФорму("Справочник.бит_ПоставщикиУслуг.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", СтруктураОбора),Элемент);
	
КонецПроцедуры

// БИТ_ЖКХ_27012014_начало_изменений
&НаСервере
Функция ПолучитьСписокПоставщиковНаСервере(Услуга)
	
	ТаблицаПоставщиков = Услуга.Поставщики;
	
	СписокПоставщиков = Новый СписокЗначений;
	
	СписокПоставщиков.ЗагрузитьЗначения(ТаблицаПоставщиков.ВыгрузитьКолонку("Поставщик"));
	
	Возврат СписокПоставщиков;
	
КонецФункции

&НаСервере
Функция ПолучитьУлицуЗданияНаСервере(Здание)
	
	Возврат Здание.Улица;	
	
КонецФункции

&НаСервере
Функция ПолучитьСписокРежимовПотребленияНаСервере(Услуга)
	
	ТаблицаРежимовПотребления = Услуга.РежимыПотребленияУслуг;
	
	СписокРежимовПотребления = Новый СписокЗначений;
	
	СписокРежимовПотребления.ЗагрузитьЗначения(ТаблицаРежимовПотребления.ВыгрузитьКолонку("РежимПотребленияУслуг"));
	
	Возврат СписокРежимовПотребления;
	
КонецФункции
// БИТ_ЖКХ_27012014_окончание_изменений 

&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Услуга) Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Укажите услугу.");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Укажите услугу.";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Дата"              , Объект.Дата);
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	СписокУслуг = Новый СписокЗначений;
	СписокУслуг.Добавить(Объект.Услуга);
	
	ПараметрыФормы.Вставить("СписокУслуг", СписокУслуг);
	
	
	Если ЗначениеЗаполнено(Объект.Здание) Тогда
		
		ПараметрыФормы.Вставить("Здание"     , Объект.Здание);
		ПараметрыФормы.Вставить("Организация", ПолучитьОрганизациюЗданияНаСервере(Объект.Здание));
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Улица) Тогда
		
		ПараметрыФормы.Вставить("Улица", Объект.Улица);
		
	КонецЕсли; 
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, ЭтаФорма, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизациюЗданияНаСервере(Знач Здание)
	
	Возврат Здание.Организация;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.бит_ПодборЛицевыхСчетов.Форма.ФормаУправляемая" Тогда
		
		ОбработкаВыбораНаСервере(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЛСВХранилище);
	
	Если ТаблицаЛС = Неопределено Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Ошибка получения данных из временного хранилища. Выполните подбор заново.", СтатусСообщения.ОченьВажное);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка получения данных из временного хранилища. Выполните подбор заново.";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
	Иначе	
		
		Для Каждого СтрокаТаблицы Из ТаблицаЛС Цикл
			
			ЛС =  СтрокаТаблицы.ЛицевойСчет;
			
			Отбор = Новый Структура;
			
			Отбор.Вставить("ЛицевойСчет", ЛС);
			
			СтрокаПоиска = объект.ЛицевыеСчета.НайтиСтроки(Отбор);
			
			Если СтрокаПоиска.Количество() = 0 Тогда
				
				НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
				
				НоваяСтрока.ЛицевойСчет = ЛС;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
